# 짝지어 제거하기 (level 2)
# 짝지어 제거하기는, 알파벳 소문자로 이루어진 문자열을 가지고 시작합니다. 먼저 문자열에서 같은 알파벳이 2개 붙어 있는 짝을 찾습니다. 그다음, 그 둘을 제거한 뒤, 앞뒤로 문자열을 이어 붙입니다. 이 과정을 반복해서 문자열을 모두 제거한다면 짝지어 제거하기가 종료됩니다. 문자열 S가 주어졌을 때, 짝지어 제거하기를 성공적으로 수행할 수 있는지 반환하는 함수를 완성해 주세요. 성공적으로 수행할 수 있으면 1을, 아닐 경우 0을 리턴해주면 됩니다.

# 예를 들어, 문자열 S = baabaa 라면

# b aa baa → bb aa → aa →

# 의 순서로 문자열을 모두 제거할 수 있으므로 1을 반환합니다.
def solution(s):
    temp = [s[0]]
    for x in s[1:]:
        if len(temp) ==0 or temp[-1] != x:
            temp.append(x)
            continue
        temp.pop()
        
    return 0 if len(temp)>0 else 1
          

# 풀이과정
# 처음엔 복잡하게 생각하느라 시간이 많이 들었다.
# 하지만 생각보다 간단히 풀 수 있는 문제였다. 
# temp를 바구니처럼 사용하며
# s를 순회할 때 temp의 마지막 원소를 확인 후, 같은 요소면 temp의 마지막 요소를 제거, 
# 다른 요소면 추가를 시켜나가면 된다. 
# 그 다음 요소를 순회할 때 짝이 맞다면 점점 제거되어 
# 결국 temp가 비워졌다면 모든 짝을 맞춘 것이 된다.